mermaid impl
